# Kaggle_Future Sales

## Import necessary libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

import warnings
warnings.filterwarnings("ignore", category=FutureWarning)

df_categories = pd.read_csv("Data/item_categories.csv")
df_items = pd.read_csv("Data/items.csv")
df_shops = pd.read_csv("Data/shops.csv")
df_sales = pd.read_csv("Data/sales_train.csv")
df_test = pd.read_csv("Data/test.csv")

#### item_categories

In [2]:
print(df_categories.shape)
df_categories.head()

(84, 2)

        item_category_name  item_category_id
0  PC - Гарнитуры/Наушники                 0
1         Аксессуары - PS2                 1
2         Аксессуары - PS3                 2
3         Аксессуары - PS4                 3
4         Аксессуары - PSP                 4

#### items

In [3]:
print(df_items.shape)
df_items.head()

(22170, 3)

,item_name,item_id,item_category_id
0,! ВО ВЛАСТИ НАВАЖДЕНИЯ (ПЛАСТ.) D,0,40
1,!ABBYY FineReader 12 Professional Edition Full...,1,76
2,***В ЛУЧАХ СЛАВЫ (UNV) D,2,40
3,***ГОЛУБАЯ ВОЛНА (Univ) D,3,40
4,***КОРОБКА (СТЕКЛО) D,4,40

#### shops

In [4]:
print(df_shops.shape)
df_shops.head()

(60, 2)

                        shop_name  shop_id
0   !Якутск Орджоникидзе, 56 фран        0
1   !Якутск ТЦ "Центральный" фран        1
2                Адыгея ТЦ "Мега"        2
3  Балашиха ТРК "Октябрь-Киномир"        3
4        Волжский ТЦ "Волга Молл"        4

#### TRAIN dataframe

In [5]:
print(df_sales.shape)
df_sales.head()#### shops

(2935849, 6)

         date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0  02.01.2013               0       59    22154      999.00           1.0
1  03.01.2013               0       25     2552      899.00           1.0
2  05.01.2013               0       25     2552      899.00          -1.0
3  06.01.2013               0       25     2554     1709.05           1.0
4  15.01.2013               0       25     2555     1099.00           1.0

#### TEST dataframe

In [6]:
print(df_test.shape)
df_test.head()

(214200, 3)

   ID  shop_id  item_id
0   0        5     5037
1   1        5     5320
2   2        5     5233
3   3        5     5232
4   4        5     5268

In [7]:
df_sales.dtypes

date               object
date_block_num      int64
shop_id             int64
item_id             int64
item_price        float64
item_cnt_day      float64
dtype: object

In [8]:
df_sales.isnull().sum()

date              0
date_block_num    0
shop_id           0
item_id           0
item_price        0
item_cnt_day      0
dtype: int64

In [9]:
agg_item_price = {'item_price':'item_mean_price'}
vec_prices = df_sales.groupby('item_id').agg({'item_price':'mean'}).rename(columns=agg_item_price)
df_sales.drop(['date_block_num', 'item_price'], axis=1, inplace=True)
print(vec_prices.shape)

(21807, 1)

In [10]:
df_sales = pd.merge(df_sales, vec_prices, on='item_id', how='left')
print(df_sales.shape)
df_sales.head()

(2935849, 5)

         date  shop_id  item_id  item_cnt_day  item_mean_price
0  02.01.2013       59    22154           1.0       702.932203
1  03.01.2013       25     2552           1.0       937.888889
2  05.01.2013       25     2552          -1.0       937.888889
3  06.01.2013       25     2554           1.0      1709.050000
4  15.01.2013       25     2555           1.0      1123.101786

In [11]:
df_sales = pd.merge(df_sales, df_items, on='item_id', how='left')
df_sales.drop('item_name', axis=1, inplace=True)
df_sales = df_sales[['date', 'shop_id', 'item_id', 'item_category_id', 'item_mean_price', 'item_cnt_day']]
df_sales['date'] = pd.to_datetime(df_sales['date'], dayfirst=True)
df_sales['date'] = df_sales['date'].apply(lambda x: x.strftime('%Y-%m'))
print(df_sales.shape)
df_sales.head()

(2935849, 6)

      date  shop_id  item_id  item_category_id  item_mean_price  item_cnt_day
0  2013-01       59    22154                37       702.932203           1.0
1  2013-01       25     2552                58       937.888889           1.0
2  2013-01       25     2552                58       937.888889          -1.0
3  2013-01       25     2554                58      1709.050000           1.0
4  2013-01       25     2555                56      1123.101786           1.0

In [12]:
agg_item_cnt = {'item_cnt_day':'item_sum_qty'}
df_sales = df_sales.groupby(['date', 'shop_id', 'item_id', 'item_category_id', 'item_mean_price']).agg({'item_cnt_day':'sum'}).rename(columns=agg_item_cnt)
print(df_sales.shape)
df_sales.head()

(1609124, 1)

                                                          item_sum_qty
date    shop_id item_id item_category_id item_mean_price
2013-01 0       32      40               249.629240                6.0
                33      37               252.831928                3.0
                35      40               375.828056                1.0
                43      40               167.222222                1.0
                51      57               265.708333                2.0

In [13]:
df_train = df_sales.pivot_table(index=['shop_id', 'item_id', 'item_category_id', 'item_mean_price'], columns='date', values='item_sum_qty', fill_value=0)
df_train.reset_index(inplace=True)
print(df_train.shape)
df_train.head()

(424124, 38)

date,shop_id,item_id,item_category_id,item_mean_price,2013-01,2013-02,2013-03,2013-04,2013-05,2013-06,...,2015-01,2015-02,2015-03,2015-04,2015-05,2015-06,2015-07,2015-08,2015-09,2015-10
0,0,30,40,323.679206,0,31,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,31,37,578.630005,0,11,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,0,32,40,249.629240,6,10,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,0,33,37,252.831928,3,3,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0,35,40,375.828056,1,14,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [14]:
X_train = df_train.drop(['2015-10'], axis=1)
Y_train = df_train['2015-10'].values
print(X_train.shape, Y_train.shape)

(424124, 37) (424124,)

In [15]:
data = pd.merge(df_test, df_train, on = ['item_id','shop_id'],how = 'left')
data.fillna(0, inplace=True)
data.drop(['ID', '2013-01'] , axis=1, inplace=True)
print(data.shape)
data.head()

(214200, 37)

,shop_id,item_id,item_category_id,item_mean_price,2013-02,2013-03,2013-04,2013-05,2013-06,2013-07,...,2015-01,2015-02,2015-03,2015-04,2015-05,2015-06,2015-07,2015-08,2015-09,2015-10
0,5,5037,19.0,1926.828388,0.0,0.0,0.0,0.0,0.0,0.0,...,2.0,0.0,0.0,0.0,1.0,1.0,1.0,3.0,1.0,0.0
1,5,5320,0.0,0.000000,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,5,5233,19.0,800.777500,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,3.0,2.0,0.0,1.0,3.0,1.0
3,5,5232,23.0,790.512923,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0
4,5,5268,0.0,0.000000,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [16]:
from sklearn.linear_model import LinearRegression
from sklearn.ensemble import RandomForestRegressor
from sklearn.model_selection import train_test_split
from sklearn.metrics import mean_squared_error

x_train, x_train_test, y_train, y_train_test = train_test_split(X_train, Y_train, test_size=0.1, random_state=42)
print('Train set:', x_train.shape,  y_train.shape)
print('Test set:', x_train_test.shape,  y_train_test.shape)

Train set: (381711, 37) (381711,)
Test set: (42413, 37) (42413,)

In [17]:
lr = LinearRegression()
lr.fit(x_train, y_train)
print('Train set mse:', mean_squared_error(y_train, lr.predict(x_train)))
print('Test set mse:', mean_squared_error(y_train_test, lr.predict(x_train_test)))
print('Test set score:', lr.score(x_train, y_train))

Train set mse: 10.555194390023724
Test set mse: 2.2664315160728634
Test set score: 0.4014117378102491

In [18]:
rfr = RandomForestRegressor()
rfr.fit(x_train, y_train)
print('Train set mse:', mean_squared_error(y_train, rfr.predict(x_train)))
print('Test set mse:', mean_squared_error(y_train_test, rfr.predict(x_train_test)))
print('Test set score:', rfr.score(x_train, y_train))

Train set mse: 1.7875625281954146
Test set mse: 0.6380089854525735
Test set score: 0.8986267890699069

In [19]:
from sklearn.ensemble import AdaBoostRegressor
rfr = AdaBoostRegressor()
rfr.fit(x_train, y_train)
print('Train set mse:', mean_squared_error(y_train, rfr.predict(x_train)))
print('Test set mse:', mean_squared_error(y_train_test, rfr.predict(x_train_test)))
print('Test set score:', rfr.score(x_train, y_train))

Train set mse: 2.7426480208011603
Test set mse: 2.067325339968205
Test set score: 0.8444636022884429

In [20]:
df_submission = pd.read_csv('Data/sample_submission.csv')
print(df_submission.shape)
df_submission.head()

(214200, 2)

   ID  item_cnt_month
0   0             0.5
1   1             0.5
2   2             0.5
3   3             0.5
4   4             0.5

In [22]:
test_pred = rfr.predict(data)
df_submission['item_cnt_month1'] = test_pred 
df_submission.head()

   ID  item_cnt_month  item_cnt_month1
0   0             0.5         0.505185
1   1             0.5         0.505185
2   2             0.5         0.505185
3   3             0.5         0.505185
4   4             0.5         0.505185